//=============== Задача 19. ===========================
/*
 Напишите программу, которая принимает на вход 
 пятизначное число и проверяет, является ли оно полиндроном.
 14212 -> нет
 12821 -> да
 23432 -> да
*/1


//=============== Задача 21. ===========================
/*
Напишите программу, которая принимает на вход координаты
двуч точек и находит расстояние между ними в 3D пространстве
A(3,6,8);   B(2, 1, -7) -> 15.84
A(7, -5, 0);B(1, -1, 9) ->11.53
*/



//=============== Задача 23. ===========================
/*
Напищите программу, которая принимает на вход чисо (N) 
и выдает таблицу кубов чисел от 1 до N
3-> 1, 8, 27
5-> 1, 8, 27, 64, 125
*/